---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarHostCategory
source: html/faf9636e-fe80-7112-1326-7aa8d7444311.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarHostCategory Property

"Host Category"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarHostCategory { get; }
```